I managed to fix the error, but every time I do a plan, it wants to perform changes:

``` 
  # akamai_property.dd_lfvp_stv will be updated in-place
  ~ resource "akamai_property" "dd_lfvp_stv" {
        id                 = "prp_593090"
      ~ latest_version     = 22 -> (known after apply)
        name               = "dd_lfvp_stv"
      ~ production_version = 22 -> (known after apply)
      ~ staging_version    = 21 -> (known after apply)
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # akamai_property_activation.dd_lfvp_stv will be updated in-place
  ~ resource "akamai_property_activation" "dd_lfvp_stv" {
        id            = "prp_593090:PRODUCTION"
      ~ version       = 22 -> (known after apply)
        # (5 unchanged attributes hidden)
    }
```

When I do an apply, it 'changes' things, but nothing really happens. There is no activation or anything like that. How do I get idempotence again?